# Словарь: корпус установщика компонентов <-> посадочные места на плате
# Посадочные на плате (значения словаря) могут быть просто строкой, кортежем из строк и/или скомпилированным шаблоном регулярных выражений - re.compile()
# Корпуса установщика компонентов (ключи словаря) могут быть просто строкой, кортежем состоящим из имени корпуса и данных о смещении компонента или
# специальным значением None при котором компонент отключается (при наличии соответствующей настройки)
# Примеры:
#   "RES0603": "RC_0603" - посадочное RC_0603 будет заменено на RES0603
#   "RES0603": ("RC_0603", "JC_0603") - посадочные RC_0603 и JC_0603 будут заменены на RES0603
#   ("RES0603", 90): ("RC_0603", "JC_0603") - посадочные RC_0603 и JC_0603 будут заменены на RES0603 и к значению угла поворота будет добавлено 90
#   ("RES0603", 90, 0.8, -0.4): ("RC_0603", "JC_0603") - посадочные RC_0603 и JC_0603 будут заменены на RES0603, к значению угла поворота будет добавлено 90, к координате X будет добавлено 0.8, из координаты Y вычтено 0.4, смещение вращается на оригинальный угол поворота компонента
#   ("RES0603", 90, 0.8, -0.4, False): ("RC_0603", "JC_0603") - посадочные RC_0603 и JC_0603 будут заменены на RES0603, к значению угла поворота будет добавлено 90, к координате X будет добавлено 0.8, из координаты Y вычтено 0.4 независимо от угла поворота компонента
#   None: re.compile(r"^tp-pad-") - компоненты с посадочными начинающимися на tp-pad- будут отключены

import re
data = {
    #Элементы которые не устанавливаются автоматическим монтажом и будут исключены при экспорте (например батарейки или тестовые площадки)
    None: (re.compile(r"^tp-pad-"), re.compile(r"^pad-"), re.compile(r"^screwTerm-"), re.compile(r"^TRPL_"), re.compile(r"^netTie-"), re.compile(r"^harness-"), re.compile(r"^coax-"), 
           "BR-2477A-FBN"),
    #Реперные метки
    "FIDUCIAL": re.compile(r"^fiducial"),
    #Резисторы/Перемычки
    ("RES0201", -90): ("RC_0201", "JC_0201"),
    ("RES0402", -90): ("RC_0402", "JC_0402"),
    ("RES0603", -90): ("RC_0603", "JC_0603"),
    ("RES0805", -90): ("RC_0805", "JC_0805"),
    ("RES1206", -90): ("RC_1206", "JC_1206"),
    ("RES1210", -90): ("RC_1210", "JC_1210"),
    ("RES1218", -90): ("RC_1218", "JC_1218"),
    ("RES2010", -90): ("RC_2010", "JC_2010"),
    ("RES2512", -90): ("RC_2512", "JC_2512"),
    #Конденсаторы
    ("CAP0201", -90): "MLCC_0201",
    ("CAP0402", -90): "MLCC_0402",
    ("CAP0603", -90): ("MLCC_0603", "SFCC_0603"),
    ("CAP0805", -90): ("MLCC_0805", "SFCC_0805"),
    ("CAP1206", -90): ("MLCC_1206", "SFCC_1206"),
    ("CAP1210", -90): ("MLCC_1210", "SFCC_1210"),
    ("CAP1808", -90): "MLCC_1808",
    ("CAP1812", -90): "MLCC_1812",
    ("CAP1913", -90): "SFCC_1913",
    ("CAP2010", -90): "MLCC_2010",
    ("CAP2211", -90): "MLCC_2211",
    ("CAP2220", -90): "MLCC_2220",
    ("CAP2225", -90): "MLCC_2225",
    ("CAP2416", -90): "SFCC_2416",
    ("CAP2512", -90): "MLCC_2512",
    ("A-type", -90): re.compile(r"^CCM_3216-18"),
    ("B-type", -90): re.compile(r"^CCM_3528-21"),
    ("C-type", -90): re.compile(r"^CCM_6032-28"),
    ("D-type", -90): re.compile(r"^CCM_7343-31"),
    ("E-type", -90): re.compile(r"^CCM_7260-38"),
    ("X-type", -90): re.compile(r"^CCM_7343-43"),
    #Индуктивности
    ("IND0402", -90): re.compile(r"^LC_0402"),
    ("IND0603", -90): re.compile(r"^LC_0603"),
    ("IND0805", -90): re.compile(r"^LC_0805"),
    ("IND1206", -90): re.compile(r"^LC_1206"),
    ("IND1812", -90): re.compile(r"^LC_1812"),
    ("SRR0604", -90): "SRR0604",
    ("SRR1210", -90): "SRR1210",
    #Диоды
    ("SMA", -90): re.compile(r"^DO-214AC"),
    ("SMB", -90): re.compile(r"^DO-214AA"),
    ("SMC", -90): re.compile(r"^DO-214AB"),
    ("SOD-80", -90): "SOD-80",
    ("SOD-123", -90): ("SOD-123", "SOD-123F"),
    ("SOD-323", -90): ("SOD-323", "SOD-323F"),
    ("SOD-523", -90): ("SOD-523", "SOD-523F"),
    #Транзисторы
    ("SOT-23", -90): "SOT-23",
    ("SOT-23-5", -90): "SOT-23-5",
    ("SOT-23-6", -90): "SOT-23-6",
    ("SOT-23-8", -90): "SOT-23-8",
    ("SOT-89", 180): "SOT-89",
    ("SOT-143", -90): "SOT-143",
    ("SOT-223", -90): "SOT-223",
    ("SOT-323", -90): "SOT-323",
    ("SOT-353", -90): "SOT-323-5",
    ("SOT-363", -90): "SOT-323-6",
    ("SOT-416", -90): "SOT-416",
    ("DPAK", 90): "TO-252(DPAK)",
    ("D2PAK", 90): "TO-263AB(D2PAK)",
    ("PowerPAK-SO-8-4", -90): "PowerPAK-SO-8LD",
    ("PowerPAK-1212-8S", -90): "PowerPAK-1212-8S",
    #Светодиоды
    ("LED_0603", -90): "LEDC_0603-0.75",
    ("LED_0805", -90): "LEDC_0805-0.75",
    #Микросхемы
    ("LQFP-48", -90): "LQFP-48",
    ("LQFP-144", -90): "LQFP-144",
    ("MSOP-8", -90): "MSOP-8",
    ("MSOP-10", -90): "MSOP-10",
    ("SOIC-16W", 180): "SO-16W",
    ("SOIC-20W", -90): "SO-20W",
    ("SSOP-8", -90): "SSOP-8",
    ("TSSOP-14", -90): "TSSOP-14",
    ("TSSOP-24", -90): "TSSOP-24",
    ("TSSOP-28", -90): "TSSOP-28",
    ("TSSOP-56", -90): "TSSOP-56",
    #Резонаторы
    ("HC49SM", -90): "HC-49/US-SMD",
    #Соединители
    "u.fl-r-smt-1": "U.FL-R-SMT-1(01)"
}